# StackOverflow 问答 10389000-10389999

# java - 禁用在 JTextPane 中选择范围

> ID：10389000
> 
> 赞同：0
> 
> 时间：2012-04-30T18:56:50.997
> 
> 标签：java, swing, selection, jtextpane

我有一个 JTextPane，我希望用户能够正常编辑，但我不希望用户选择一系列字符；我只想要一个光标。我该怎么做？使用 JTextPane 的 setSelectionStart 和 setSelectionEnd 大部分时间都有效，但并非总是如此。

```
boolean selectionAlreadyHandled = false;
JTextPane jtextpane;

public void caretUpdate (CaretEvent evt)
  {
  if (selectionAlreadyHandled)
    {
    selectionAlreadyHandled = false;
    return;
    }

  int pos = evt.getDot();
  if (pos != evt.getMark())
    {
    selectionAlreadyHandled = true;
    if (pos < evt.getMark())
      jtextpane.setSelectionEnd(pos);
    if (pos > evt.getMark())
      jtextpanel.setSelectionBegin(pos);
    }

  //Event handling
  return;
  } 
```

* * *

## 回答 #1

> 赞同：1
> 
> 时间：2012-04-30T19:05:16.127

这应该可以做到。如果没有，我不知道会不会有什么

```
 public class MyTextPane extends JTextPane {
  public void setSelectionStart(int spot) {
    super.setSelectionStart(spot);
    super.setSelectionEnd(spot);
  }

  public void setSelectionEnd(int spot) {
    super.setSelectionStart(spot);
    super.setSelectionEnd(spot);
  }

  public void select(int start, int end) {
    super.select(start, start);
  }
} 
```

# java - 如何将 null 传递给需要 long 或 int 的方法？

> ID：10389001
> 
> 赞同：28
> 
> 时间：2012-04-30T18:56:54.650
> 
> 标签：java

可能是愚蠢的问题，但我怎样才能传递`null`给采用`long`or的方法`int`？

**例子：**

```
TestClass{
  public void iTakeLong(long id);
  public void iTakeInt(int id);
} 
```



[http://jquerymobile.com/test/docs/api/events.html](http://jquerymobile.com/test/docs/api/events.html)

# java - 无法使用 instanceof 比较两个对象

> ID：10389755
> 
> 赞同：2
> 
> 时间：2012-04-30T19:54:59.410
> 
> 标签：java, oop

当试图比较作为参数传递的两个对象时：第一个作为对象，第二个作为对象数组（相同类型）。得到错误`Incompatible conditional operand types Room and allRooms[]`。我正在尝试循环迭代，`while`直到`thisRoomType`不等于来自`rooms`. 如何解决？

```
public abstract class Room { ...}
public class LightRoom extends Room  {...}
public class DarkRoom extends Room {...} 
```

呼叫者：

```
release(thisRoomType, rooms) 
```

带参数

```
private Room thisRoomType = this; // is defined in DarkRoom and LightRoom 
private Room[] rooms; // is defined in DarkRoom and LightRoom 
```

在方法中：

```
public synchronized void release( Room thisRoom,  Room[] allRooms) {

        try {
            int j = 0;
            while(thisRoom instanceof allRooms[j]){     
                jj++;
            }
                        int nextRoom = jj;
...
    }
} 
```

* * *

## 回答 #1

> 赞同：6
> 
> 时间：2012-04-30T19:59:02.047

试试这个：

```
while (j < allRooms.length && thisRoom.getClass().equals(allRooms[j].getClass())) 
```

* * *

## 回答 #2

> 赞同：2
> 
> 时间：2012-04-30T20:13:21.983

你的逻辑是错误的。
`instanceof`预计`ReferenceType`您正在传递**一个对象实例** `allRooms[j]`。这永远行不通。
你应该做的是：

1.  比较`package`名字或
2.  `class`姓名或
3.  与具体类 ( `getClass`) 进行比较。

根据你的需要选择

# clr - CorFlags.exe /32BIT+ 是如何工作的？

> ID：10389756
> 
> 赞同：13
> 
> 时间：2012-04-30T19:55:01.250
> 
> 标签：clr, loader, corflags

我想我的问题是关于[CLR](http://en.wikipedia.org/wiki/Common_Language_Runtime) Loader 的。我想了解[CorFlags.exe](http://msdn.microsoft.com/en-us/library/ms164699%28v=vs.80%29.aspx) `/32BIT+`功能背后的机制。

我们知道，当启动在 64 位 Windows 上设置了*Any CPU*标志的程序集时，它会作为 64 位进程启动。如果`CorFlags /32BIT+`在该程序集上运行，它将作为 32 位进程启动。我认为这是一个令人着迷的功能。

我有很多关于它的问题：

1.  它是如何实施的？
2.  OS Loader 是否参与其中？
3.  是否可以构建一个自定义应用程序（我猜是非托管应用程序），它可以随意加载 32 位或 64 位 CLR？

是否有文章、书籍、博客等解释了此功能的内部工作原理？

* * *

## 回答 #1

> 赞同：7
> 
> 时间：2012-05-01T01:09:24.653

这在我所知道的任何地方都没有很好的记录，我只能将您指向相关的 MSDN 文章。是的，您的假设是正确的，Windows XP 及更高版本中的加载程序具有托管可执行文件的意识。它会自动加载 .NET 加载程序 shim (c:\windows\system32\mscoree.dll)，相关入口点是[_CorValidateImage()](http://msdn.microsoft.com/en-us/library/4ce9k7xb%28v=vs.90%29.aspx)。链接的 MSDN 文章中的备注部分描述了将 32 位 .exe 文件转换为 64 位进程的机制：

> 在 Windows XP 和更高版本中，操作系统加载程序通过检查通用对象文件格式 (COFF) 标头中的 COM 描述符目录位来检查托管模块。设置位指示受管模块。如果加载器检测到托管模块，它会加载 MsCorEE.dll 并调用 _CorValidateImage，后者执行以下操作：
> 
> *   确认映像是有效的托管模块。
> *   将映像中的入口点更改为公共语言运行时 (CLR) 中的入口点。
> *   对于 64 位版本的 Windows，通过将内存中的图像从 PE32 转换为 PE32+ 格式来修改它。
> *   加载托管模块映像时返回到加载程序。
> 
> 对于可执行映像，操作系统加载程序然后调用 _CorExeMain 函数，而不管可执行文件中指定的入口点。对于 DLL 程序集映像，加载程序调用 _CorDllMain 函数。
> 
> _CorExeMain 或 _CorDllMain 执行以下操作：
> 
> *   初始化 CLR。
> *   从程序集的 CLR 标头中找到托管入口点。
> *   开始执行。
> 
> 卸载托管模块映像时，加载程序调用 _CorImageUnloading 函数。但是，此函数不执行任何操作；它只是返回。

* * *

## 回答 #2

> 赞同：2
> 
> 时间：2015-04-18T19:10:23.463

为了补充 Hans 的答案，还有一些响应该标志的 Windows 内核模式代码。每个加载的可执行文件都有一个`SECTION_IMAGE_INFORMATION`与之关联的内核结构 。这是它的符号信息：

```
 0: kd> dt nt!_SECTION_IMAGE_INFORMATION
           +0x000 TransferAddress           : Ptr64 Void
           +0x008 ZeroBits                  : Uint4B
           +0x010 MaximumStackSize          : Uint8B
           +0x018 CommittedStackSize        : Uint8B
           +0x020 SubSystemType             : Uint4B
           +0x024 SubSystemMinorVersion     : Uint2B
           +0x026 SubSystemMajorVersion     : Uint2B
           +0x024 SubSystemVersion          : Uint4B
           +0x028 GpValue                   : Uint4B
           +0x02c ImageCharacteristics      : Uint2B
           +0x02e DllCharacteristics        : Uint2B
           +0x030 Machine                   : Uint2B
           +0x032 ImageContainsCode         : UChar
           +0x033 ImageFlags                : UChar
           +0x033 ComPlusNativeReady        : Pos 0, 1 Bit
           +0x033 ComPlusILOnly             : Pos 1, 1 Bit
           +0x033 ImageDynamicallyRelocated : Pos 2, 1 Bit
           +0x033 ImageMappedFlat           : Pos 3, 1 Bit
           +0x033 BaseBelow4gb              : Pos 4, 1 Bit
           +0x033 Reserved                  : Pos 5, 3 Bits 
```

标志`ComPlusILOnly`和`ComPlusNativeReady`与 .NET 相关，`ComPlusILOnly`只是告诉程序集是否仅为[CIL](http://en.wikipedia.org/wiki/Common_Intermediate_Language)（不是混合或本机 - 在这种情况下，程序集已经是特定于体系结构的），并且`ComPlusNativeReady`仅在未设置 /32BIT+ 时为 1（[32BITREQ 或 32BITPREF 在较新CorFlags 版本](https://msdn.microsoft.com/en-us/library/ms164699%28v=vs.110%29.aspx)）。在创建过程中`nt!PspAllocateProcess`并基于它们检查这些标志。`32-bit``64-bit`

[我写了](http://debugandconquer.blogspot.co.il/2015/04/the-relationship-between-net-and.html)一些细节。

# java - 从瘦客户端（Web 浏览器）流向已安装并正在运行的应用程序

> ID：10389757
> 
> 赞同：1
> 
> 时间：2012-04-30T19:55:06.207
> 
> 标签：java, web-applications, legacy-code, thick-client, thin-client

所以我正在处理一个大规模的应用程序。我们正在从已安装的 Java 应用程序迁移到基于 Web 的应用程序。在过渡版本期间，我们需要能够在本地安装（并假定正在运行）的应用程序上显示某些屏幕。是否有捷径可寻？

我查看了自定义 URL 处理程序和某种消息传递系统，但对于大量动态的客户端来说，这些似乎都不可行。

* * *

## 回答 #1

> 赞同：0
> 
> 时间：2012-04-30T19:59:25.660

如何使用 JMS，让 Java 应用程序订阅一个主题。然后服务器可以向 JMS 主题发送一条消息，该消息由 java 应用程序解释以打开特定屏幕？

